biddr_api/app/views/auctions/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
<% @bids.each do |bid| %>
    <p>$<%= bid.price %> on <%= bid.created_at %> by <%= @auction.user.first_name %> <%= @auction.user.last_name %> </p>