biddr_api/app/controllers/auctions_controller.rb

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @auction = Auction.find(params[:id])

SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC
---
    def index
        # @auctions = Auction.all
        @auctions = Auction.order(created_at: :desc)