biddr_api/app/controllers/bids_controller.rb

SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "bids" ("price", "auction_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["price", 11], ["auction_id", 10], ["created_at", "2022-08-24 00:41:44.221609"], ["updated_at", "2022-08-24 00:41:44.221609"], ["user_id", nil]]
---
    def create
        @auction = Auction.find params[:auction_id]

        @bid = Bid.new(params.require(:bid).permit(:price))
        @bid.auction = @auction

        if @bid.save!