biddr_api/app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @user = User.new(params.require(:user).permit(:first_name, :last_name, :email, :reserve_price, :password, :password_confirmation))

        if @user.save!